Homework 1

In [2]:
import pandas as pd
#Task1
data={"First Name": ['Alice', 'Bob', 'Charlie', 'David'],
      "Age":[25, 30, 35, 40],
      "City": ['New York', 'San Francisco', 'Los Angeles', 'Chicago']}
df=pd.DataFrame(data)
df = df.rename(columns={"First Name":"first_name", "Age":"age"})
print(df)

  first_name  age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles
3      David   40        Chicago

In [3]:
#Task2
df.head(3)

  first_name  age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles

In [4]:
#Task3
df['age'].mean()

np.float64(32.5)

In [5]:
#Task4.
df1=df[['first_name', 'City']]
print(df1)

  first_name           City
0      Alice       New York
1        Bob  San Francisco
2    Charlie    Los Angeles
3      David        Chicago

In [8]:
import numpy as np
#Task5.
df['Salary']=np.random.randint(0,200,4)
print(df)

  first_name  age           City  Salary
0      Alice   25       New York      34
1        Bob   30  San Francisco      19
2    Charlie   35    Los Angeles     193
3      David   40        Chicago      83

In [9]:
#Task6.
df.describe()

             age      Salary
count   4.000000    4.000000
mean   32.500000   82.250000
std     6.454972   78.728965
min    25.000000   19.000000
25%    28.750000   30.250000
50%    32.500000   58.500000
75%    36.250000  110.500000
max    40.000000  193.000000

Homework2

In [15]:
import pandas as pd
#Task1
month=['Jan','Feb', 'Mar', 'Apr']
sales=[5000, 6000, 7500, 8000]
expenses=[3000, 3500, 4000, 4500]

data=pd.DataFrame({'Month':month, 'Sales':sales, 'Expenses':expenses})
data

  Month  Sales  Expenses
0   Jan   5000      3000
1   Feb   6000      3500
2   Mar   7500      4000
3   Apr   8000      4500

In [12]:
#Task2
max_exp=data['Expenses'].max()
max_sales=data['Sales'].max()
print(max_exp)
print(max_sales)

4500
8000

In [13]:
#Task3
min_exp=data['Expenses'].min()
min_sales=data['Sales'].min()
print(min_exp)
print(min_sales)

3000
5000

In [16]:
#Task4
avg_exp=data['Expenses'].mean()
avg_sales=data['Sales'].mean()
print(avg_exp)
print(avg_sales)

3750.0
6625.0

In [20]:
#1. T-SQL Query | [Finding Previous Value Puzzle] – Write a query which will extract the previous value from the currentQuota for each row.
import pandas as pd
import sqlalchemy as sa

connection_string = 'mssql+pyodbc://DESKTOP-75UE17H\\SQLEXPRESS/AdventureWorks2022?driver=ODBC+Driver+17+for+SQL+Server'
engine = sa.create_engine(connection_string)
con = engine.connect()

df = pd.read_sql(sa.text('select * from lag'), con=con)
print(df)
df['lagCurrentData'] = df['CurrentQuota'].shift(1).fillna(0)
print(df)

   BusinessEntityID  SalesYear  CurrentQuota
0               275       2005      367000.0
1               275       2005      556000.0
2               275       2006      502000.0
3               275       2006      550000.0
4               275       2006     1429000.0
5               275       2006     1324000.0
   BusinessEntityID  SalesYear  CurrentQuota  lagCurrentData
0               275       2005      367000.0             0.0
1               275       2005      556000.0        367000.0
2               275       2006      502000.0        556000.0
3               275       2006      550000.0        502000.0
4               275       2006     1429000.0        550000.0
5               275       2006     1324000.0       1429000.0

In [22]:
#2.T-SQL Query | [Finding Next Value Puzzle] – Write a query which will extract the next value from the currentQuota for each row
import pandas as pd
data = {
    'BusinessEntityID': [275, 275, 275, 275, 275, 275],
    'SalesYear': [2005, 2005, 2006, 2006, 2006, 2006],
    'CurrentQuota': [367000.00, 556000.00, 502000.00, 550000.00, 1429000.00, 1324000.00]
}

df1 = pd.DataFrame(data)
print(df1)
df1['NextCurrentQuota']=df1['CurrentQuota'].shift(-1).fillna(0)
print(df1)

   BusinessEntityID  SalesYear  CurrentQuota
0               275       2005      367000.0
1               275       2005      556000.0
2               275       2006      502000.0
3               275       2006      550000.0
4               275       2006     1429000.0
5               275       2006     1324000.0
   BusinessEntityID  SalesYear  CurrentQuota  NextCurrentQuota
0               275       2005      367000.0          556000.0
1               275       2005      556000.0          502000.0
2               275       2006      502000.0          550000.0
3               275       2006      550000.0         1429000.0
4               275       2006     1429000.0         1324000.0
5               275       2006     1324000.0               0.0

In [34]:
#3. T-SQL Query | [The Birth Day Puzzle] – Write a query which will find the Date 
# of Birth of employees whose birthdays lies between May 7 and May 15
data={
    'EmpId':[1, 2, 3, 4, 5], 
    'EmpName': ['Pawan', 'Zuzu', 'Parveen', 'Mahesh', 'Ramesh'],
    'BirthDate':pd.to_datetime(['1983-12-04', '1986-11-28', '1977-05-07', '1983-01-13', '1983-05-09'])
        }
EmpBirth=pd.DataFrame(data)
print(EmpBirth)
result=EmpBirth[(7<=EmpBirth.BirthDate.dt.day) & (EmpBirth.BirthDate.dt.day<=15) &(EmpBirth.BirthDate.dt.month==5)]
result

   EmpId  EmpName  BirthDate
0      1    Pawan 1983-12-04
1      2     Zuzu 1986-11-28
2      3  Parveen 1977-05-07
3      4   Mahesh 1983-01-13
4      5   Ramesh 1983-05-09

   EmpId  EmpName  BirthDate
2      3  Parveen 1977-05-07
4      5   Ramesh 1983-05-09

In [63]:
#4. T-SQL Query | [Movie Puzzle] – Write a query which will gets the movie details where 
# Mr. Amitabh and Mr. Vinod acted together and their role is actor.
import pandas as pd

data = {
    'MName': ['A', 'A', 'B', 'B', 'D', 'E'],
    'AName': ['Amitabh', 'Vinod', 'Amitabh', 'Vinod', 'Amitabh', 'Vinod'],
    'Roles': ['Actor', 'Villan', 'Actor', 'Actor', 'Actor', 'Actor']
}

movie_df = pd.DataFrame(data)
print(movie_df)

df1=movie_df[(movie_df.AName=='Vinod')&(movie_df.Roles=='Actor')]
df2=movie_df[(movie_df.AName=='Amitabh')&(movie_df.Roles=='Actor')]
result1=pd.merge(df1, df2, on='MName', suffixes=("_Vinod", "_Amitabh"))
print(result1)
result = pd.DataFrame({
    'MName': [result1['MName'],result1['MName']],
    'AName': ['Vinod', 'Amitabh'],  
    'Roles': ['Actor', 'Actor']     
})

print(result)

  MName    AName   Roles
0     A  Amitabh   Actor
1     A    Vinod  Villan
2     B  Amitabh   Actor
3     B    Vinod   Actor
4     D  Amitabh   Actor
5     E    Vinod   Actor
  MName AName_Vinod Roles_Vinod AName_Amitabh Roles_Amitabh
0     B       Vinod       Actor       Amitabh         Actor
                               MName    AName  Roles
0  0    B
Name: MName, dtype: object    Vinod  Actor
1  0    B
Name: MName, dtype: object  Amitabh  Actor

In [65]:
#5. T-SQL Query | [Movie Puzzle] – Write a query which will remove the unwanted null values from the table. Please check sample input and expected output for details.
import pandas as pd
data={
    'ID':[1,1],
    'Name':['P', None],
    'Typed':[None, 'Q']
}

df=pd.DataFrame(data)
print(df)
filtered_df=df.fillna("").groupby('ID', as_index=False).max()
filtered_df

   ID  Name Typed
0   1     P  None
1   1  None     Q

   ID Name Typed
0   1    P     Q